/**
 * 关于cstyle函数的简介
 *
 * 关于cstule函数更详细的介绍，这个函数名由6个英文字母组成，它们分别是c、s、t
 * y、l、e
 *
 * @param theory 参数说明param是关键字，theory是参数名
 *
 */
void cstyle( int theory );

/*******************************************************************************
 * 这是一个神奇的函数。
 *
 * 这个函数有很多功能，比如，它首先名字叫javadocBanner，另外，一般注释用*号画一个
 * 框的话，它的宽度是刚好80个字符，这样既美观又能给你编码时在哪里折行提供一个
 * 可视化的参考。
 *
 * 然后，它有一个int参数。
 *
 * 最后，它没有返回值。
 *
 * 我也不知道这个函数怎么用。
 *
 * @param theory 把所有的参数都要在函数头注释里写出来。
 *
 ******************************************************************************/
void javadocBanner( int theory );

/***************************************************************************//**
 * 函数简述。
 *
 * 函数详述巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦
 * 巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦巴啦。
 * 补充描述哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩哔哩
 * 哔哩哔哩哔哩哔哩哔哩哔哩。
 *
 * @param theory 参数描述
 *
 ******************************************************************************/
void doxygenBanner( int theory );
